formal/mutants/autostop-wake-honors-expired-demand.patch
diff --git a/internal/controller/engine_autostop.go b/internal/controller/engine_autostop.go
index 337d66a..ef646b4 100644
--- a/internal/controller/engine_autostop.go
+++ b/internal/controller/engine_autostop.go
@@ -177,7 +177,7 @@ func computeAutoStopDecision(
 	// either. Users who want an engine to stay down set
 	// autoStop.enabled: false, which returns at the top of this function
 	// before wake is ever consulted.
-	if obs.WakeRequestedAt != nil && now.Sub(*obs.WakeRequestedAt) < DefaultAutoStopWakeTTL {
+	if obs.WakeRequestedAt != nil && now.Sub(*obs.WakeRequestedAt) >= DefaultAutoStopWakeTTL {
 		return decisionWithScale(spec.Replicas, as.ActiveReplicas, AutoStopReasonWakeRequested, pollInterval)
 	}
 
